app/Controllers/CobaController.php

    public function create()
    {
        $value = $this->request->getPost('value');

        if (!$value) {
            return redirect()->back()->with('error', 'Value is required');
        }

        $db = \Config\Database::connect();
        $builder = $db->table('coba');
        $builder->insert(['value' => $value]);
---
INSERT INTO `coba` (`value`) VALUES ('ammar')

    public function delete()
    {
        $id = $this->request->getPost('id');

        if (!$id) {
            return redirect()->back()->with('error', 'ID is required for delete');
        }

        $db = \Config\Database::connect();
        $builder = $db->table('coba');

        // Delete data
        $builder->where('id', $id)->delete();
---
DELETE FROM `coba`
WHERE `id` = '3'

    public function show()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('coba');
        $query = $builder->get();
---
SELECT *
FROM `coba`