app/Controllers/CobaController.php

SELECT *
FROM `coba`
---
    public function show()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('coba');
        $query = $builder->get();