app/Controllers/RegisterController.php

SELECT *
FROM `account`
WHERE `username` = 'ammarnfl'
 LIMIT 1
---
    public function register_action()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $fullname = $this->request->getPost('fullname');

        // Cek apakah username sudah ada
        $accountModel = new Account();
        if ($accountModel->where('username', $username)->first()) {