app/Controllers/RentCarController.php

    public function index()
    {
        $model = new RentCar();
        $data['cars'] = $model->findAll();
---
SELECT *
FROM `rentcar`