app/Controllers/VendorController.php

SELECT *
FROM `vendor`
---
    public function index()
    {
        $model = new Vendor();
        $data['vendors'] = $model->findAll();